modm-ext/data.modm.io/docs/svd/header_stm32f398xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP2</name>
      <description>Analog Comparators</description>
      <groupName>COMP</groupName>
      <alternatePeripheral>COMP12_COMMON</alternatePeripheral>
      <baseAddress>0x40010020</baseAddress>
      <registers>
        <register>
          <name>CSR</name>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMP2EN</name>
              <description>COMP2 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2INSEL</name>
              <description>COMP2 inverting input select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>COMP2OUTSEL</name>
              <description>COMP2 output select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>COMP2POL</name>
              <description>COMP2 output polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2BLANKING</name>
              <description>COMP2 blanking</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP2OUT</name>
              <description>COMP2 output level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2LOCK</name>
              <description>COMP2 lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP3</name>
      <description>Analog Comparators</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40010024</baseAddress>
      <registers>
        <register>
          <name>CSR</name>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMP3EN</name>
              <description>COMP3 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP3INSEL</name>
              <description>COMP3 inverting input select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>COMP3OUTSEL</name>
              <description>COMP3 output select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>COMP3POL</name>
              <description>COMP3 output polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP3BLANKING</name>
              <description>COMP3 blanking</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP3OUT</name>
              <description>COMP3 output level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP3LOCK</name>
              <description>COMP3 lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="COMP12_COMMON">
      <name>COMP34_COMMON</name>
      <groupName>COMP_Common</groupName>
      <baseAddress>0x40010028</baseAddress>
    </peripheral>
    <peripheral>
      <name>COMP4</name>
      <description>Analog Comparators</description>
      <groupName>COMP</groupName>
      <alternatePeripheral>COMP34_COMMON</alternatePeripheral>
      <baseAddress>0x40010028</baseAddress>
      <interrupt>
        <name>COMP4_5_6</name>
        <description>COMP4, COMP5 and COMP6 global Interrupt via EXTI Line30, 31 and 32</description>
        <value>65</value>
      </interrupt>
      <registers>
        <register>
          <name>CSR</name>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMP4EN</name>
              <description>COMP4 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP4INSEL</name>
              <description>COMP4 inverting input select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>COMP4OUTSEL</name>
              <description>COMP4 output select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>COMP4POL</name>
              <description>COMP4 output polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP4BLANKING</name>
              <description>COMP4 blanking</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP4OUT</name>
              <description>COMP4 output level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP4LOCK</name>
              <description>COMP4 lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
